In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# Concatenate

In [2]:
arr1 = np.arange(9).reshape(3,3)

In [9]:
arr1

numpy.ndarray

In [4]:
arr2 = np.arange(9).reshape(3,3)

In [5]:
arr2

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [8]:
np.concatenate([arr1,arr2],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [11]:
s1 = Series([1,2,3], index=['X','Y','Z'])

In [12]:
s2 = Series([4,5], index=['A','B'])

In [13]:
s1

X    1
Y    2
Z    3
dtype: int64

In [14]:
s2

A    4
B    5
dtype: int64

In [19]:
pd.concat([s1,s2],axis=1) # 默认将两个series合并成一个，1的时候变成两列，没有值的部分补nan,数据类型也会有所改变

pandas.core.series.Series

In [21]:
df1 = DataFrame(np.random.randn(4,3), columns=['X','Y','Z'])

In [22]:
df1

          X         Y         Z
0  0.034057  0.667327 -0.649188
1  1.011487 -0.036038  0.374701
2  0.448768 -0.570069  0.841877
3  0.121258  1.088714 -0.079056

In [23]:
df2 = DataFrame(np.random.randn(3,3), columns=['X','Y','A'])

In [24]:
df2

          X         Y         A
0  0.546621  0.173822 -0.055316
1 -0.018830  0.970779  0.970264
2 -0.644678  0.469287 -0.993350

In [25]:
pd.concat([df1,df2],axis=1) # dataframe也是一样

          X         Y         Z         X         Y         A
0  0.034057  0.667327 -0.649188  0.546621  0.173822 -0.055316
1  1.011487 -0.036038  0.374701 -0.018830  0.970779  0.970264
2  0.448768 -0.570069  0.841877 -0.644678  0.469287 -0.993350
3  0.121258  1.088714 -0.079056       NaN       NaN       NaN

In [33]:
#For more info in documentation:
url='http://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html'

# Combine

In [34]:
s1 = Series([2, np.nan, 4, np.nan], index=['A','B','C','D'])

In [35]:
s1

A    2.0
B    NaN
C    4.0
D    NaN
dtype: float64

In [36]:
s2 = Series([1,2,3,4], index=['A','B','C','D'])

In [37]:
s2

A    1
B    2
C    3
D    4
dtype: int64

In [38]:
s1.combine_first(s2)

A    2.0
B    2.0
C    4.0
D    4.0
dtype: float64

In [39]:
df1 = DataFrame({
    'X': [1, np.nan, 3, np.nan],
    'Y': [5, np.nan, 7, np.nan],
    'Z': [9, np.nan, 11,np.nan]
})

In [40]:
df1

     X    Y     Z
0  1.0  5.0   9.0
1  NaN  NaN   NaN
2  3.0  7.0  11.0
3  NaN  NaN   NaN

In [29]:
df2 = DataFrame({
    'Z':[np.nan, 10, np.nan, 12,np.nan],
    'A':[1,2,3,4,5]
})

In [30]:
df2

      Z  A
0   NaN  1
1  10.0  2
2   NaN  3
3  12.0  4
4   NaN  5

In [31]:
df1.combine_first(df2)

     A         X         Y         Z
0  1.0  0.034057  0.667327 -0.649188
1  2.0  1.011487 -0.036038  0.374701
2  3.0  0.448768 -0.570069  0.841877
3  4.0  0.121258  1.088714 -0.079056
4  5.0       NaN       NaN       NaN

# concatenate是合并两个序列，总元素数量不会变化，有着横着或者竖着的区别

#combine 更像是不全的一种概念，用第二个数据不全第一个为nan的，或者根本就没有的column,row

combine 更像是不全的一种概念，用第二个数据不全第一个为nan的，或者根本就没有的column,row

# combine 更像是不全的一种概念，用第二个数据不全第一个为nan的，或者根本就没有的column,row